Marylebone/Marylebone_run/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    Marylebone.stl
    {
        type triSurfaceMesh;
        name buildings;
    }

    sourceTerm.stl
    {
        type triSurfaceMesh;
        name sourceTerm;
    }

    refinementBox
    {
        type searchableBox;
        min (0 -400. 0.);
        max (900 400. 100.);
    }
};

castellatedMeshControls
{
    features
    (
      { file  "Marylebone.eMesh"; level 4; }
    );

    features
    (
      { file  "sourceTerm.eMesh"; level 3; }
    );

    refinementSurfaces
    {
        buildings
        {
            level (4 4);
            patchInfo { type wall; }
        }

        sourceTerm
        {
          level (3 3);

          faceZone sourceTerm;
          cellZone sourceTerm;
          cellZoneInside inside;
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    locationInMesh (1 1 1);
}

snapControls
{
    explicitFeatureSnap    true;
    implicitFeatureSnap    true;
}

addLayersControls
{
    layers
    {
        "buildings.*"
        {
            nSurfaceLayers 2;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
}

meshQualityControls
{
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
