Marylebone/Marylebone_run/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Marylebone.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}

sourceTerm.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}

// ************************************************************************* //
